In [4]:
import numpy as np
import pandas as pd

C:\Users\DELL7\AppData\Local\Temp\ipykernel_82956\1662815981.py:2: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [5]:
#series
marks = pd.Series([10,20,30],index=["python","DSA","dbms"])
marks

python    10
DSA       20
dbms      30
dtype: int64

In [6]:
marks.keys()

Index(['python', 'DSA', 'dbms'], dtype='object')

In [7]:
marks.values

array([10, 20, 30], dtype=int64)

In [8]:
pd.Series(["dev","dev@gmail.com","vadodara"],["sname","mail","add"])

sname              dev
mail     dev@gmail.com
add           vadodara
dtype: object

In [11]:
my_dict = {'sname':'dev',
           'mail': 'dev@gmail.com',
           'add' : 'vadodara'}
pd.Series(my_dict)

sname              dev
mail     dev@gmail.com
add           vadodara
dtype: object

In [12]:
#dataframe #data,index=[],columns={}
np.random.seed(1) #lock the values 

mat = np.random.randint(0,100,(5,5))

result = pd.DataFrame(mat,['dev','keval','taha','shirke','dev'],['python','dsa','dbms','ooad','stb'])
result

        python  dsa  dbms  ooad  stb
dev         37   12    72     9   75
keval        5   79    64    16    1
taha        76   71     6    25   50
shirke      20   18    84    11   28
dev         29   14    50    68   87

In [13]:
#for multiple columns, double square brackets
result [['python','dsa']]

        python  dsa
dev         37   12
keval        5   79
taha        76   71
shirke      20   18
dev         29   14

In [14]:
result.loc[['dev','keval']]

       python  dsa  dbms  ooad  stb
dev        37   12    72     9   75
dev        29   14    50    68   87
keval       5   79    64    16    1

In [15]:
result['total']=result['python']+result['dsa']+result['dbms']+result['ooad']+result['stb']
result['percentage'] = result['total']/5 
#result.drop('percentage',axis=1, inplace=True) #to delete a column .drop() is used #inplace is used to delete permanently
#result.drop('dev') #to delete row
result

        python  dsa  dbms  ooad  stb  total  percentage
dev         37   12    72     9   75    205        41.0
keval        5   79    64    16    1    165        33.0
taha        76   71     6    25   50    228        45.6
shirke      20   18    84    11   28    161        32.2
dev         29   14    50    68   87    248        49.6

In [16]:
result.describe()

,python,dsa,dbms,ooad,stb,total,percentage
count,5.000000,5.000000,5.000000,5.000000,5.00000,5.000000,5.000000
mean,33.400000,38.800000,55.200000,25.800000,48.20000,201.400000,40.280000
std,26.613906,33.237028,30.152943,24.386472,34.86689,38.240031,7.648006
min,5.000000,12.000000,6.000000,9.000000,1.00000,161.000000,32.200000
25%,20.000000,14.000000,50.000000,11.000000,28.00000,165.000000,33.000000
50%,29.000000,18.000000,64.000000,16.000000,50.00000,205.000000,41.000000
75%,37.000000,71.000000,72.000000,25.000000,75.00000,228.000000,45.600000
max,76.000000,79.000000,84.000000,68.000000,87.00000,248.000000,49.600000

In [17]:
result.head()

        python  dsa  dbms  ooad  stb  total  percentage
dev         37   12    72     9   75    205        41.0
keval        5   79    64    16    1    165        33.0
taha        76   71     6    25   50    228        45.6
shirke      20   18    84    11   28    161        32.2
dev         29   14    50    68   87    248        49.6

In [18]:
result.head(2)

       python  dsa  dbms  ooad  stb  total  percentage
dev        37   12    72     9   75    205        41.0
keval       5   79    64    16    1    165        33.0

In [19]:
result.tail()

        python  dsa  dbms  ooad  stb  total  percentage
dev         37   12    72     9   75    205        41.0
keval        5   79    64    16    1    165        33.0
taha        76   71     6    25   50    228        45.6
shirke      20   18    84    11   28    161        32.2
dev         29   14    50    68   87    248        49.6

In [20]:

result.tail(3)

        python  dsa  dbms  ooad  stb  total  percentage
taha        76   71     6    25   50    228        45.6
shirke      20   18    84    11   28    161        32.2
dev         29   14    50    68   87    248        49.6

In [21]:
result.iloc[3]

python         20.0
dsa            18.0
dbms           84.0
ooad           11.0
stb            28.0
total         161.0
percentage     32.2
Name: shirke, dtype: float64

In [24]:

#1
pname = ['keval','dev','shirke','taha','dhriti']
pid = [1,2,3,4,5]
pprice = [100,200,300,350,400]


demo = pd.DataFrame((pname,pid,pprice),['name','id','price'])
demo

           0    1       2     3       4
name   keval  dev  shirke  taha  dhriti
id         1    2       3     4       5
price    100  200     300   350     400

In [26]:

#2Extract one by one column and display separately from above dataframe
demo[0]

name     keval
id           1
price      100
Name: 0, dtype: object

In [27]:
demo[1]

name     dev
id         2
price    200
Name: 1, dtype: object

In [28]:
demo[2]

name     shirke
id            3
price       300
Name: 2, dtype: object

In [29]:
demo[3]

name     taha
id          4
price     350
Name: 3, dtype: object

In [30]:
demo[4]

name     dhriti
id            5
price       400
Name: 4, dtype: object

In [31]:
#3
demo.loc[['id','name','price']]

           0    1       2     3       4
id         1    2       3     4       5
name   keval  dev  shirke  taha  dhriti
price    100  200     300   350     400

In [32]:
demo.iloc[2]

0    100
1    200
2    300
3    350
4    400
Name: price, dtype: object

In [33]:
#4
demo.loc['name']

0     keval
1       dev
2    shirke
3      taha
4    dhriti
Name: name, dtype: object

In [34]:
demo.iloc[1:4]

         0    1    2    3    4
id       1    2    3    4    5
price  100  200  300  350  400

In [35]:
#5
demo.iloc[1:3]

         0    1    2    3    4
id       1    2    3    4    5
price  100  200  300  350  400

In [40]:
np.random.seed(1) #lock the values 

mat = np.random.randint(0,100,(5,5))

temp = pd.DataFrame(mat,['keval','dev','shirke','taha','dhriti'],['python','dsa','dbms','ooad','stb'])
temp.sum()/5

python    33.4
dsa       38.8
dbms      55.2
ooad      25.8
stb       48.2
dtype: float64

In [41]:
#8 change marks in python column to 41 for students who have scored less than 40
temp.loc[temp['python']<40, 'python'] = 41
temp

        python  dsa  dbms  ooad  stb
keval       41   12    72     9   75
dev         41   79    64    16    1
shirke      76   71     6    25   50
taha        41   18    84    11   28
dhriti      41   14    50    68   87

In [42]:
#9
temp = temp + 20
temp

        python  dsa  dbms  ooad  stb
keval       61   32    92    29   95
dev         61   99    84    36   21
shirke      96   91    26    45   70
taha        61   38   104    31   48
dhriti      61   34    70    88  107

In [43]:
temp[temp>100] = 100
temp

        python  dsa  dbms  ooad  stb
keval       61   32    92    29   95
dev         61   99    84    36   21
shirke      96   91    26    45   70
taha        61   38   100    31   48
dhriti      61   34    70    88  100

In [44]:
#10
temp[(temp['python']>50) & (temp['dsa']>60)]

        python  dsa  dbms  ooad  stb
dev         61   99    84    36   21
shirke      96   91    26    45   70

In [45]:
#11
temp[temp.index.str.startswith('s')]

        python  dsa  dbms  ooad  stb
shirke      96   91    26    45   70

In [35]:
#12
temp[temp.index.str.endswith('i')]

        python  dsa  dbms  ooad  stb
dhriti      61   34    70    88  100

In [36]:
#13
print(temp.sum())
temp.sum()/5

python    340
dsa       294
dbms      372
ooad      229
stb       334
dtype: int64

python    68.0
dsa       58.8
dbms      74.4
ooad      45.8
stb       66.8
dtype: float64

In [49]:
#14 Calculate Status (PASS / FAIL) for the Students.
result['result'] = np.where(result['percentage']<35,'fail','pass')
result

        python  dsa  dbms  ooad  stb  total  percentage result
dev         37   12    72     9   75    205        41.0   pass
keval        5   79    64    16    1    165        33.0   fail
taha        76   71     6    25   50    228        45.6   pass
shirke      20   18    84    11   28    161        32.2   fail
dev         29   14    50    68   87    248        49.6   pass

In [50]:
#16
result.describe()

,python,dsa,dbms,ooad,stb,total,percentage
count,5.000000,5.000000,5.000000,5.000000,5.00000,5.000000,5.000000
mean,33.400000,38.800000,55.200000,25.800000,48.20000,201.400000,40.280000
std,26.613906,33.237028,30.152943,24.386472,34.86689,38.240031,7.648006
min,5.000000,12.000000,6.000000,9.000000,1.00000,161.000000,32.200000
25%,20.000000,14.000000,50.000000,11.000000,28.00000,165.000000,33.000000
50%,29.000000,18.000000,64.000000,16.000000,50.00000,205.000000,41.000000
75%,37.000000,71.000000,72.000000,25.000000,75.00000,228.000000,45.600000
max,76.000000,79.000000,84.000000,68.000000,87.00000,248.000000,49.600000

In [52]:
result.to_json('result.json')

ValueError: DataFrame index must be unique for orient='columns'.

In [46]:
result.to_excel('result.xlsx')

ModuleNotFoundError: No module named 'openpyxl'

In [47]:
result.to_html('result.html')

In [48]:
#17
result.dtypes

python          int32
dsa             int32
dbms            int32
ooad            int32
stb             int32
total           int32
percentage    float64
result         object
dtype: object

In [49]:
#18
result.to_dict (orient = 'list')

{'python': [37, 5, 76, 20, 29],
 'dsa': [12, 79, 71, 18, 14],
 'dbms': [72, 64, 6, 84, 50],
 'ooad': [9, 16, 25, 11, 68],
 'stb': [75, 1, 50, 28, 87],
 'total': [205, 165, 228, 161, 248],
 'percentage': [41.0, 33.0, 45.6, 32.2, 49.6],
 'result': ['pass', 'fail', 'pass', 'fail', 'pass']}

In [46]:
#task2

In [53]:
#2
sal = pd.read_csv('Salaries.csv')

FileNotFoundError: [Errno 2] No such file or directory: 'Salaries.csv'

In [52]:
sal

                              { Unnamed: 1 Unnamed: 2
0                    "cells": [        NaN        NaN
1                             {        NaN        NaN
2           "cell_type": "code"        NaN        NaN
3       "execution_count": null        NaN        NaN
4                "metadata": {}        NaN        NaN
..                          ...        ...        ...
760                           }        NaN        NaN
761                           }        NaN        NaN
762               "nbformat": 4        NaN        NaN
763         "nbformat_minor": 1        NaN        NaN
764                           }        NaN        NaN

[765 rows x 3 columns]

In [55]:
#3
sal.head()

                            { Unnamed: 1 Unnamed: 2
0                  "cells": [        NaN        NaN
1                           {        NaN        NaN
2         "cell_type": "code"        NaN        NaN
3     "execution_count": null        NaN        NaN
4              "metadata": {}        NaN        NaN

In [56]:
#4
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 765 entries, 0 to 764
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   {           765 non-null    object
 1   Unnamed: 1  13 non-null     object
 2   Unnamed: 2  1 non-null      object
dtypes: object(3)
memory usage: 18.1+ KB

In [53]:
#extra
sal = sal.replace('Not Provided',np.nan)
sal = sal.replace('Not provided',np.nan)
sal

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,NaN,NaN,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,NaN,NaN,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,NaN,NaN,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

In [54]:
#5
sal['BasePay']=sal['BasePay'].astype('float')

In [55]:
sal['BasePay'].mean()

66325.4488404877

In [56]:
#6
sal['OvertimePay']=sal['OvertimePay'].astype('float')
sal['OvertimePay'].max()

245131.88

In [59]:
#7
sal[sal['EmployeeName']=='JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [60]:
#8
sal[sal['EmployeeName']=='JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

In [61]:
#9
sal[sal['TotalPayBenefits']== sal['TotalPayBenefits'].max()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

In [63]:
#or
sal.loc[sal['TotalPayBenefits'].idxmax()]

Id                                                               1
EmployeeName                                        NATHANIEL FORD
JobTitle            GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY
BasePay                                                  167411.18
OvertimePay                                                    0.0
OtherPay                                                 400184.25
Benefits                                                       NaN
TotalPay                                                 567595.43
TotalPayBenefits                                         567595.43
Year                                                          2011
Notes                                                          NaN
Agency                                               San Francisco
Status                                                         NaN
Name: 0, dtype: object

In [64]:
#10
sal[sal['TotalPayBenefits']== sal['TotalPayBenefits'].min()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

In [66]:
#or
sal.loc[sal['TotalPayBenefits'].idxmax()]['EmployeeName']

'NATHANIEL FORD'

In [67]:
#11
sal.groupby('Year').mean()['BasePay']

<ipython-input-67-36d31bc2f71c>:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  sal.groupby('Year').mean()['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

In [68]:
#12
sal['JobTitle'].nunique()

2158

In [70]:
#13
sal['JobTitle'].value_counts().head(5)

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

In [47]:
#14
sum(sal[sal['Year']==2013]['JobTitle'].value_counts() == 1)

NameError: name 'sal' is not defined

In [46]:
#15
def chief_string(title):
    if 'chief' in title.lower():
        return True
    else:
        return False